src/bsl/InformationRegisters/гкс_СтатусыЗаписейВОчередиПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СтатусыЗаписейВОчередиПриемкиПЛК</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьВОчередь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ДокументыЗаписьВОчередь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиПриемкаПЛКПоТочкамМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКДокументамСАРА</Name>
					<Comment>ERP-1605</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуютсяЭлектронныеТабло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДопустимогоОтклоненияБрутто</Name>
					<Comment>ERP-2051</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическоеФормированиеДокументов</Name>
					<Comment>ERP-2240</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияТаблоЭлектроннойОчереди</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПогрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ВариантыИспользованияТаблоЭлектроннойОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</Name>
			<Comment>ERP-2673</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтборПоНоменклатуре</Name>
					<Comment>Табло используется для определенной номенклатуры.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОтбора</Name>
					<Comment>Табло используется для всей принимаемой номенклатуры</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыТранспортныхСредствДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТранспортныхСредствДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трубопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ВидыЭлектронныхТабло.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ВидыЭлектронныхТабло</Name>
			<Comment>ERP-1130</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеНаВесы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеНаВыгрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданияПроб</Name>
					<Comment>ERP-1425</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрошедшиеРегистрацию</Name>
					<Comment>ERP-2056</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СтатусыЗаписейВОчередиПриемкиПЛК/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьВариантыТаблоДляОбновления();
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИнформациюНаЭлектронныхТабло(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьВариантыТаблоДляОбновления()
	
	ЗаписьВОчередь = ЭтотОбъект.Отбор.ЗаписьВОчередь.Значение;
	Если Не ЗначениеЗаполнено(ЗаписьВОчередь) Тогда
		Возврат;
	КонецЕсли;
		
	ЗначенияЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьВОчередь, "Номенклатура, ТочкаМаршрута");	
	
	НастройкиПриемкиПЛКМенеджер = РегистрыСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута;
						
	Если Не НастройкиПриемкиПЛКМенеджер.ИспользуетсяЭлектронноеТабло(ЗначенияЗаполнения.ТочкаМаршрута) Тогда	
		Возврат;		
	КонецЕсли;
	
	ТаблицаВариантовТабло = ТаблицаВариантовТаблоИнициализировать();
	
	ВариантИспользованияТабло = НастройкиПриемкиПЛКМенеджер.ПолучитьВариантИспользованияТаблоЭлектроннойОчереди(
		ЗначенияЗаполнения.ТочкаМаршрута);
							
	Если ВариантИспользованияТабло = Перечисления.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди.БезОтбора Тогда
		ЗначенияЗаполнения.Вставить("Номенклатура", Неопределено);
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("ВариантИспользования", ВариантИспользованияТабло);
	ЗначенияЗаполнения.Вставить("ВидПеревозки", Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль);
	ЗначенияЗаполнения.Вставить("ВидТабло", Перечисления.гкс_ВидыЭлектронныхТабло.НеПрошедшиеРегистрацию);
	
	ТипЗаписиВОчередь = ТипЗнч(ЗаписьВОчередь);
	Если ТипЗаписиВОчередь = Тип("ДокументСсылка.гкс_ЗаписьВОчередьПриемкиПЛК") Тогда
		ЗначенияЗаполнения.Вставить("ТипРегистрации", Перечисления.гкс_ТипРегистрации.Приемка);
		
	ИначеЕсли ТипЗаписиВОчередь = Тип("ДокументСсылка.гкс_ЗаписьВОчередьОтгрузкиПЛК") Тогда
		ЗначенияЗаполнения.Вставить("ТипРегистрации", Перечисления.гкс_ТипРегистрации.Отгрузка);  	
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректная запись'");
	КонецЕсли;	
	
	Для Каждого Запись Из ЭтотОбъект Цикл							
		НовыйВариант = ТаблицаВариантовТабло.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйВариант, ЗначенияЗаполнения);							
	КонецЦикла;	
	
	ТаблицаВариантовТабло.Свернуть
	("ТочкаМаршрута, Номенклатура, ТипРегистрации, ВидПеревозки, ВидТабло, ВариантИспользования");
	
	ДополнительныеСвойства.Вставить("ВариантыДляТабло", ТаблицаВариантовТабло);

КонецПроцедуры

Функция ТаблицаВариантовТаблоИнициализировать()
	
	Таблица = Новый ТаблицаЗначений;
	КолонкиТаблицы = Таблица.Колонки;
	
	КолонкиТаблицы.Добавить("ТочкаМаршрута",	Новый ОписаниеТипов("СправочникСсылка.гкс_ТочкиМаршрута"));
	КолонкиТаблицы.Добавить("ТипРегистрации",	Новый ОписаниеТипов("ПеречислениеСсылка.гкс_ТипРегистрации"));
	КолонкиТаблицы.Добавить("ВидТабло", 		Новый ОписаниеТипов("ПеречислениеСсылка.гкс_ВидыЭлектронныхТабло"));
	КолонкиТаблицы.Добавить("Номенклатура",		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	КолонкиТаблицы.Добавить("Весы", 			Новый ОписаниеТипов("СправочникСсылка.гкс_ОборудованиеПЛК"));
	
	КолонкиТаблицы.Добавить("ВидПеревозки", 
		Новый ОписаниеТипов("ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки"));
		
	КолонкиТаблицы.Добавить("ВариантИспользования", 
		Новый ОписаниеТипов("ПеречислениеСсылка.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди"));
	
	Возврат Таблица;
	
КонецФункции

Процедура ОбновитьИнформациюНаЭлектронныхТабло(Отказ)
	
	Перем ВариантыДляТабло; 
	
	ДополнительныеСвойства.Свойство("ВариантыДляТабло", ВариантыДляТабло);
	
	Если Отказ Или Не ЗначениеЗаполнено(ВариантыДляТабло) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаВариантыТабло Из ВариантыДляТабло Цикл
		
		ВариантТаблоВСтруктуре = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаВариантыТабло);
		
		гкс_ИнтеграцияСЭлектроннымТаблоСервер.ОбновитьТаблоДляЭлектроннойОчереди(ВариантТаблоВСтруктуре, Отказ);
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура;
		
		Если ЗначениеЗаполнено(ВариантТаблоВСтруктуре.Номенклатура) Тогда
			СтруктураОтбора.Вставить("Номенклатура", ВариантТаблоВСтруктуре.Номенклатура);	
		КонецЕсли;

		ОписанияТаблоДляОбновления = гкс_ИнтеграцияСЭлектроннымТаблоСервер.ПолучитьНастройкиПоВидуТабло(
			ВариантТаблоВСтруктуре.ТочкаМаршрута, ВариантТаблоВСтруктуре.ВидТабло, СтруктураОтбора);

	    Для Каждого ОписаниеТабло Из ОписанияТаблоДляОбновления Цикл
			
			ТаблоОбъект = ОписаниеТабло.Табло.ПолучитьОбъект();
			Событие = "ЭлектронноеТабло.ИзменениеСтатусаЗаписиВОчередиПриемки";
			
			гкс_ИнтеграцияСЭлектроннымТаблоСервер.ОтправитьДанныеНаЭлектронноеТабло(ТаблоОбъект, Событие);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("Недопустимый вызов объекта на клиенте", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
#КонецЕсли
